/*
 * Copyright (c) 2013. Axetta LLC. All Rights Reserved.
 */

package ru.axetta.soap;

import com.sun.org.apache.xml.internal.security.Init;
import com.sun.org.apache.xml.internal.security.transforms.Transforms;
import com.sun.org.apache.xpath.internal.XPathAPI;
import com.sun.xml.internal.ws.developer.JAXWSProperties;
import junit.framework.TestCase;
import ru.CryptoPro.JCP.JCP;

import ru.axetta.ecafe.processor.web.partner.integra.dataflowtest.ClientRoomController;
import ru.axetta.ecafe.processor.web.partner.integra.dataflowtest.ClientRoomControllerWSService;
import ru.axetta.ecafe.processor.web.partner.integra.dataflowtest.Result;

import org.apache.ws.security.message.WSSecHeader;
import org.apache.ws.security.message.token.X509Security;
import org.w3c.dom.*;

import javax.xml.crypto.KeySelector;
import javax.xml.crypto.XMLStructure;
import javax.xml.crypto.dsig.*;
import javax.xml.crypto.dsig.dom.DOMSignContext;
import javax.xml.crypto.dsig.dom.DOMValidateContext;
import javax.xml.crypto.dsig.keyinfo.KeyInfo;
import javax.xml.crypto.dsig.keyinfo.KeyInfoFactory;
import javax.xml.crypto.dsig.keyinfo.X509Data;
import javax.xml.crypto.dsig.spec.C14NMethodParameterSpec;
import javax.xml.namespace.QName;
import javax.xml.soap.MessageFactory;
import javax.xml.soap.SOAPBody;
import javax.xml.soap.SOAPMessage;
import javax.xml.soap.SOAPPart;
import javax.xml.transform.OutputKeys;
import javax.xml.transform.Transformer;
import javax.xml.transform.TransformerFactory;
import javax.xml.transform.dom.DOMSource;
import javax.xml.transform.stream.StreamResult;
import javax.xml.transform.stream.StreamSource;
import javax.xml.ws.BindingProvider;
import javax.xml.ws.handler.Handler;
import javax.xml.ws.handler.MessageContext;
import javax.xml.ws.handler.soap.SOAPHandler;
import javax.xml.ws.handler.soap.SOAPMessageContext;
import java.io.ByteArrayInputStream;
import java.io.InputStream;
import java.io.StringWriter;
import java.math.BigInteger;
import java.security.KeyStore;
import java.security.MessageDigest;
import java.security.PrivateKey;
import java.security.Provider;
import java.security.cert.CertificateFactory;
import java.security.cert.X509Certificate;
import java.util.*;

public class SignHandlerTest extends TestCase{

    public static class LogMessageHandler implements SOAPHandler<SOAPMessageContext> {

        void signMessage(SOAPMessage message) throws Exception {
            SOAPBody soapBody = message.getSOAPBody();
            soapBody.addAttribute(message.getSOAPPart().getEnvelope().createName("Id", "wsu",
                "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"), "body");
            /*** Инициализация ***/
            Init.init();

            // Инициализация Transforms алгоритмов.
            com.sun.org.apache.xml.internal.security.Init.init();

            // Инициализация ключевого контейнера.
            KeyStore keyStore = KeyStore.getInstance(JCP.HD_STORE_NAME);
            keyStore.load(null, null);

            // Получение ключа и сертификата.
            PrivateKey privateKey = (PrivateKey) keyStore.getKey("dituec", "1234567890".toCharArray());
            X509Certificate cert = (X509Certificate) keyStore.getCertificate("dituec");

            /*** Подготовка документа ***/
            MessageFactory mf = MessageFactory.newInstance();
            //SOAPMessage message = mf.createMessage();
            //SOAPPart soapPart = message.getSOAPPart();
            //InputStream is = this.getClass().getClassLoader().getResourceAsStream("META-INF/rnip/getPayments_byDate.xml");
            //FileInputStream fis = new FileInputStream(is);
            //soapPart.setContent(new StreamSource(is));

            message.getSOAPPart().getEnvelope().addNamespaceDeclaration("ds", "http://www.w3.org/2000/09/xmldsig#");
            message.getSOAPPart().getEnvelope().addNamespaceDeclaration("wsse", "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd");
            message.getSOAPPart().getEnvelope().addNamespaceDeclaration("wsu", "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd");

            // Формируем заголовок.
            WSSecHeader header = new WSSecHeader();
            header.setActor("http://smev.gosuslugi.ru/actors/smev");
            header.setMustUnderstand(false);

            // Получаем документ.
            Document doc = message.getSOAPPart().getEnvelope().getOwnerDocument();
            header.insertSecurityHeader(message.getSOAPPart().getEnvelope().getOwnerDocument());

            System.out.println(messageToString(doc));
            // Подписываемый элемент.
            Element token = header.getSecurityHeader();


            // Элемент SenderCertificate, который должен содержать сертификат.
            Element binarySecurityTokenEl = doc.createElementNS(
                    "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd",
                    "wsse:BinarySecurityToken");
            //Element binarySecurityTokenEl = new Element("BinarySecurityToken", null);
            binarySecurityTokenEl.setAttribute("EncodingType", "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary");
            binarySecurityTokenEl.setAttribute("ValueType", "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3");
            binarySecurityTokenEl.setAttribute("wsu:Id", "SenderCertificate");
            //Attr wsuIdAttr = doc.createAttributeNS("http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd", "id");
            //wsuIdAttr.setValue("SenderCertificate");
            //binarySecurityTokenEl.setAttributeNode(wsuIdAttr);
            token.appendChild(binarySecurityTokenEl);

            /*** Подпись данных ***/
            // Загрузка провайдера.
            Provider xmlDSigProvider = new ru.CryptoPro.JCPxml.dsig.internal.dom.XMLDSigRI();
            // Преобразования над документом.
            final Transforms transforms = new Transforms(doc);
            transforms.addTransform(Transforms.TRANSFORM_C14N_EXCL_OMIT_COMMENTS);
            XMLSignatureFactory fac = XMLSignatureFactory.getInstance("DOM", xmlDSigProvider);
            // Преобразования над блоком SignedInfo
            List<Transform> transformList = new ArrayList<Transform>();
            Transform transformC14N = fac.newTransform(Transforms.TRANSFORM_C14N_EXCL_OMIT_COMMENTS, (XMLStructure) null);
            transformList.add(transformC14N);
            // Ссылка на подписываемые данные.
            Reference ref = fac
                    .newReference("#body",
                            fac.newDigestMethod("http://www.w3.org/2001/04/xmldsig-more#gostr3411", null),
                            transformList, null, null);
            // Блок SignedInfo.
            SignedInfo si = fac.newSignedInfo(
                    fac.newCanonicalizationMethod(CanonicalizationMethod.EXCLUSIVE, (C14NMethodParameterSpec) null),
                    fac.newSignatureMethod("http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411", null),
                    Collections.singletonList(ref));
            // Блок KeyInfo.
            KeyInfoFactory kif = fac.getKeyInfoFactory();
            X509Data x509d = kif.newX509Data(Collections.singletonList(cert));
            KeyInfo ki = kif.newKeyInfo(Collections.singletonList(x509d));
            // Подпись данных.
            javax.xml.crypto.dsig.XMLSignature sig = fac.newXMLSignature(si, ki);
            DOMSignContext signContext = new DOMSignContext(privateKey, token);
            signContext.setIdAttributeNS(getNextSiblingElement(getFirstChildElement(getFirstChildElement(message.getSOAPPart()))),
                "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd", "Id");
            sig.sign(signContext);
            // Блок подписи Signature.
            Element sigE = (Element) XPathAPI.selectSingleNode(signContext.getParent(), "//ds:Signature");
            // Блок данных KeyInfo.
            Node keyE = XPathAPI.selectSingleNode(sigE, "//ds:KeyInfo", sigE);
            //
            System.out.println(messageToString(doc));
            /////
            //Element cerVal = (Element) XPathAPI.selectSingleNode(token, "//*[@wsu:Id='SenderCertificate']");
            binarySecurityTokenEl.setTextContent(
                    XPathAPI.selectSingleNode(keyE, "//ds:X509Certificate", keyE).getFirstChild().getNodeValue());
            // Удаляем элементы KeyInfo, попавшие в тело документа. Они должны быть только в header.
            keyE.removeChild(XPathAPI.selectSingleNode(keyE, "//ds:X509Data", keyE));
            NodeList chl = keyE.getChildNodes();
            for (int i = 0; i < chl.getLength(); i++) {
                keyE.removeChild(chl.item(i));
            }

            // Блок KeyInfo содержит указание на проверку подписи с помощью сертификата SenderCertificate.
            Node str = keyE.appendChild(
                    doc.createElementNS("http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd",
                            "wsse:SecurityTokenReference"));
            Element strRef = (Element) str.appendChild(
                    doc.createElementNS("http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd",
                            "wsse:Reference"));
            strRef.setAttribute("ValueType",
                    "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3");
            strRef.setAttribute("URI", "#SenderCertificate");
            header.getSecurityHeader().appendChild(sigE);

            // Получение документа в виде строки и сохранение в файл.
            //String msg = org.apache.ws.security.util.XMLUtils.PrettyDocumentToString(doc);
            
            System.out.println(messageToString(doc));

            //Array.writeFile(inSOAPFile + ".signed.uri.xml", msg.getBytes("utf-8"));

            /*** а) Проверка подписи (локально) ***/
            // Получение блока, содержащего сертификат.
            final Element wssecontext = doc.createElementNS(null, "namespaceContext");
            wssecontext.setAttributeNS("http://www.w3.org/2000/xmlns/", "xmlns:" + "wsse".trim(),
                    "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd");
            NodeList secnodeList = XPathAPI.selectNodeList(doc.getDocumentElement(), "//wsse:Security");

            // Поиск элемента сертификата.
            Element r = null;
            Element el = null;
            if (secnodeList != null && secnodeList.getLength() > 0) {
                String actorAttr = null;
                for (int i = 0; i < secnodeList.getLength(); i++) {
                    el = (Element) secnodeList.item(i);
                    actorAttr = el.getAttributeNS("http://schemas.xmlsoap.org/soap/envelope/", "actor");
                    if (actorAttr != null && actorAttr.equals("http://smev.gosuslugi.ru/actors/smev")) {
                        r = (Element) XPathAPI.selectSingleNode(el, "//wsse:BinarySecurityToken[1]", wssecontext);
                        break;
                    }
                }
            }

            if (r == null) {
                throw new Exception("X509Certificate element not found");
            }

            // Получение сертификата.
            final X509Security x509 = new X509Security(r);
            cert = (X509Certificate) CertificateFactory.getInstance("X.509")
                    .generateCertificate(new ByteArrayInputStream(x509.getToken()));
            if (cert == null) {
                throw new Exception("Сертификат не найден.");
            }

            System.out.println("Verify by: " + cert.getSubjectDN());

            // Поиск элемента с подписью.
            NodeList nl = doc.getElementsByTagNameNS("http://www.w3.org/2000/09/xmldsig#", "Signature");
            if (nl.getLength() == 0) {
                throw new Exception("Не найден элемент Signature.");
            }

            // Задаем открытый ключ для проверки подписи.
            fac = XMLSignatureFactory.getInstance("DOM", xmlDSigProvider);
            DOMValidateContext valContext = new DOMValidateContext(KeySelector.singletonKeySelector(cert.getPublicKey()),
                    nl.item(0));
            javax.xml.crypto.dsig.XMLSignature signature = fac.unmarshalXMLSignature(valContext);

            // Проверяем подпись.
            System.out.println("Verified locally: " + signature.validate(valContext));
            //return send(message);
        }

        private Element getFirstChildElement(Node node) {
          Node child = node.getFirstChild();
          while ((child != null) && (child.getNodeType() != Node.ELEMENT_NODE)) {
            child = child.getNextSibling();
          }
          return (Element) child;
        }
        public Element getNextSiblingElement(Node node) {
            Node sibling = node.getNextSibling();
            while ((sibling != null) && (sibling.getNodeType() != Node.ELEMENT_NODE)) {
              sibling = sibling.getNextSibling();
            }
            return (Element) sibling;
      }

        private String messageToString(Document doc) throws Exception {
            TransformerFactory tf = TransformerFactory.newInstance();
            Transformer transformer = tf.newTransformer();
            transformer.setOutputProperty(OutputKeys.OMIT_XML_DECLARATION, "yes");
            StringWriter writer = new StringWriter();
            transformer.transform(new DOMSource(doc), new StreamResult(writer));
            return writer.getBuffer().toString().replaceAll("\n|\r", "");
        }

        public boolean handleMessage(SOAPMessageContext messageContext) {
            boolean outbound = (Boolean) messageContext.get (MessageContext.MESSAGE_OUTBOUND_PROPERTY);
            if (outbound) {
                SOAPMessage message = messageContext.getMessage();
                try {
                    signMessage(message);
                } catch (Exception e) {
                    throw new Error(e);
                }
            } else {
                try {
                    Document doc = messageContext.getMessage().getSOAPPart().getEnvelope().getOwnerDocument();
                    System.out.println(messageToString(doc));
                } catch (Exception e) {
                    throw new Error(e);
                }
                
            }
            return true;
        }

        public Set<QName> getHeaders() {
            return Collections.EMPTY_SET;
        }

        public boolean handleFault(SOAPMessageContext messageContext) {
            return true;
        }

        public void close(MessageContext context) {
        }
    }
    
    private String[] clientFIOs = new String[]{"Тестеров Тест Тестович","Коломиец Александр Владимирович","Коломиец Александр Владимирович","Коломиец Александр Владимирович","Ростников Артур Андреевич","Ростников Артур Андреевич","Кожевникова Лариса Вячеславовна","Кожевникова Лариса Вячеславовна","Святненко Анатолий Евгеньевич","Святненко Анатолий Евгеньевич","Иванов Иван Иванович","Петров Петр Петрович","Петров Петр Петрович","Симоненко Людмила Генадиевна","Симоненко Людмила Генадиевна","Князев Борис Повлович","Баршенцева Кристина Анатольевна","Баршенцева Кристина Анатольевна","Виноходова Виктория Владимировна","Ищук Татьяна Александровна","Матылько Елена Александровна","Михальченко Наталья Михайловна","Габрусь Валентина Дмитриевна","Подкаура Ирина Владимировна","Столярчук Наталья Болиславовна","Римкус Дмитрий Викторович","Королева Галина Андреевна","Королева Галина Андреевна","Драгун Елена Дмитриевна","Полищук Марина Александровна","Харина Татьяна Владимировна","Бачурская Лада Геннадьевна","Бачурская Лада Геннадьевна","Алецкая Ирина Сергеевна","Зубрихина Виктория Викторовна","Быкова Александра Витальевна","Быкова Александра Витальевна","Фомиченко Лилия Ивановна","Алексеева Татьяна Дмитриевна","Алексеева Татьяна Дмитриевна","Музыченко Елена Анатольевна","Лукьяненко Надежда Александровна","Овсянникова Елена Павловна","Заволяко Людмила Борисовна","Мурадян Светлана Сергеевна","Феклистова Елена Владимировна","Савкуева Вераника Юрьевна","Двоенко Виталия Владимировна","Фигурова Людмила Ростиславовна","Коновалова Валентина Викторовна","Будзинаускене Анна Анатольевна","Смоленцева Галина Владимировна","Антонова Екатерина Сергеевна","Андрюкова Светлана Алексеевна","Юрченко Олеся Валентиновна","Тарасова Елена Владимировна","Тарасова Елена Владимировна","Дробинина Марина Павловна","Давидьянц Нонна Анатольевна","Фомина Ирина Викторовна","Кочеткова Наталья Владимировна","Дружинина Нина Михайловна","Дружинина Нина Михайловна","Мальцева Ирина Николаевна","Ульянова Татьяна Геннадьевна","Позняк Ольга Александровна","Зайкова Марина Николаевна","Алексеева Светлана Константиновна","Сбербанк Карта Тест","Белоусов Владислав Русланович","Бойко Елизавета Максимовна","Ворохов Максим Евгеньевич","Голомёдова Диана Александровна","Губина Анастасия Алексеевна","Дьячина Дарья Дмитриевна","Жданова Полина Алексеевна","Игнатюк Алиса Игоревна","Идман Вадим Владимирович","Кабанов Андрей Анатольевич","Кильдеева Аделина Рустамовна","Козлов Владислав Александрович","Коннов Никита Александрович","Логачев Владислав Александрович","Лопатенко Владислав Михайлович","Маркевич Мария Владмировна","Марченко Артём Михайлович","Павлов Виталий Евгеньевич","Потолочихина Анна Александровна","Пылинин Владислав Ильич","Ремизова Александра Антоновна","Сенокосова Екатерина Денисовна","Силаков Егор Сергеевич","Смирнова Валерия Игоревна","Шипулина Дарья Андреевна","Ярмолюк Кристина Александровна","Одегова Евгения Валериевна","Одегова Евгения Валериевна","Жаркова Надежда Сергеевна","Жаркова Надежда Сергеевна","Березкина Елена Евгеньевна","Березкина Елена Евгеньевна","Кулешова Ольга Александровна","Кулешова Ольга Александровна","Елина Ольга Ивановна","Елина Ольга Ивановна","Бондарева Екатерина Владимировна","Бондарева Екатерина Владимировна","Калатуша Евгений Петрович","Терихова Дина Юрьевна","Терихова Дина Юрьевна","Галинская Екатерина Михайловна","Мнацаканян Диана Сержиковна","Анисимов Никита Романович","Васильева Полина Вадимовна","Гениевская Анна Сергеевна","Гундилович Александр Константинович","Еникеев Эдуард Максимович","Зусан Яна Янисовна","Коротков Даниил Игоревич","Краснобай Егор Кириллович","Кузнецов Артём Романович","Лавриненко Дарья Дмитриевна","Люков Андрей Сергеевич","Маланина Елизавета Евгеньевна","Маринченко Александра Александровна","Маслова Милолика Андреевна","Мирошникова Мария Алексеевна","Музыченко Александра Андреевна","Некрасова Анастасия Игоревна","Рисс Дарья Алексеевна","Савинов Максим Олегович","Сикорская Диана Алексеевна","Стародубцова Надежда Игоревна","Ульянов Егор Борисович","Чачило Валерия Романовна","Шебаршов Максим Александрович","Якубенкова Екатерина Ильинична","Адамян Алина  Андреевна","Аксенова Софья Олеговна","Алексеева Арина Дмитриевна","Бедарев Данил Сергеевич","Бирюков Никита Борисович","Большаков Андрей Николаевич","Букша Алиса Михайловна","Гапонова Ксения Михайловна","Емельянов Андрей Олегович","Завадский Иван Иванович","Носков Вячеслав Денисович","Павлов Александр Игоревич","Пода Даниил Максимович","Польшина Нина Николаевна","Полянский Александр Александрович","Понамаренко Владимир Михайлович","Пыльцова Елена Эдуардовна","Рожина София Владимировна","Рожкова Ксения Евгеньевна","Садовая Татьяна Дмитриевна","Сидорова Владислава Игоревна","Слипухов Михаил Иванович","Стойко Ян Олегович","Терехова Мария Юрьевна","Шовгенова Бэлла Зауровна","Шленцов Петр Сергеевич","Андреев Егор Андреевич","Богатырев Леонид Александрович","Бояров Кирилл Владиславович","Бушуев Михаил Витальевич","Быченкова Анастасия Михайловна","Василего Екатерина Андреевна","Герасимова Жанна Игоревна","Горбунова Алиса Алексеевна","Гринчик Вячеслав Андреевич","Макарова Валерия Витальевна","Медведева Варвара Сергеевна","Морозова Дарья Васильевна","Мотылев Максим Романович","Мухин Илья Иванович","Никитина Ксения Дмитриевна","Новикова Валерия Алексеевна","Осмонова Камила Жомартовна","Петрусенко Никита Дмитриевич","Поздняков Данила Дмитриевич","Родин Максим Денисович","Синкявичюте Ева Эдуардовна","Смирнова Анна Вячеславовна","Сыркина Анастасия Андреевна","Химич Ульяна Александровна","Цуранов Максим Валерьевич","Шаталова Арина Романовна","Яшин Никита Сергеевич","Анисимова Нелли Андреевна","Басков Артем Алексеевич","Вольман Александр Витальевич","Гайдук Дмитрий Владимирович","Гончарук София Олеговна","Довженко Дмитрий Юрьевич","Дубровин Егор Евгеньевич","Захаров Иван Алексеевич","Ковшова Ульяна Алексеевна","Копытин Максим Витальевич","Котова Софья Андреевна","Кудимов Илья Денисович","Левоник София Сергеевна","Максуль Варвара Николаевна","Муравьева Катарина Игоревна","Мальцева Елизавета Андреевна","Назарова Виталина Александровна","Опацкий Игорь Витальевич","Пачина Элеонора Сергеевна","Петкайте Анна Андреевна","Пикалова Александра Андреевна","Познякова Элина Евгеньевна","Прищенко Дарья Дмитриевна","Рогачук Ангелина Денисовна","Родина Дарья Романовна","Солдатенков Александр Сергеевич","Шимчук Алина Алексеевна","Атепалихин Артём Андреевич","Божко-Домбровский Тимофей Богданович","Ембулаев Николай Николаевич","Зарайский Егор Артёмович","Зарайский Егор Артёмович","Кишкель Борис Викторович","Кобзев Илья Тимофеевич","Козлов Валерий Александрович","Коротяева Александра Дмитриевна","Кошка Владислав Витальевич","Креч Кристина Андреевна","Литвинова Елизавета Андреевна","Лось Никита Сергеевич","Лутов Степан Сергеевич","Михайлин Никита Сергеевич","Мурникова Анастасия Юрьевна","Позднякова Елена Викторовна","Сорокина Полина Викторовна","Тарасенко Элиза Владимировна","Тимощук Ликия Андреевна","Феськова Анна Анатольевна","Хроленко Родион Александрович","Чигорина Дарья Валерьевна","Чулдина Алина Дмитриевна","Шванская Юлия Витальевна","Яковлева Яна Александровна","Яничева Елизавета Максимовна","Андрякова Валерия Михайловна","Бальцевич Анна Вячеславовна","Бессмертная Евгения Александровна","Верещагин Дмитрий Анатольевич","Горобец Мария Юрьевна","Гонова Анастасия Сергеевна","Горовая Анна Андреевна","Грязнова Алина Максимовна","Золотухин Иван Юрьевич","Ильин Александр Дмитриевич","Ишимцева Виолетта Михайловна","Клепиков Тимофей Михайлович","Куляй Елизавета Андреевна","Львов Егор Ильич","Матвеев Данила Сергеевич","Матросов Даниил Александрович","Павлова    Алёна Игоревна","Побединский Никита Станиславович","Сафин Арсений Алексеевич","Сербун Полина Григорьевна","Сергеева Дарья Леонидовна","Скворцова Карина Александровна","Тишкин Вадим Валентинович","Толстова Лилия Константиновна","Шершнёва Софья Алексеевна","Якир Артур Леонидович","Белисов Илья Игоревич","Богатырь Артём Вячеславович","Винс Александр Олегович","Голденкова Майя Владимировна","Горохова Анна Александровна","Грошева Екатерина Максимовна","Двоенко Дмитрий Антонович","Дементьев Егор Андреевич","Еремина Валерия Сергеевна","Коваль Алиса Александровна","Мелентьева Алина Романовна","Одинамадов Богдан Александрович","Подобедов Дмитрий Александрович","Попович Надежда Павловна","Румянцев Артём Сергеевич","Сливаева Анастасия Сергеевна","Спиридонов Егор Денисович","Стахив Дарья Олеговна","Супрунюк Марина Сергеевна","Тынык Дарина Ивановна","Фрадкина Анастасия Романовна","Холодилин Артемий Александрович","Худяков Дмитрий Андреевич","Шиленков Никита Вячеславович","Шумилина Екатерина Дмитриевна","Юрчук Яна Евгеньевна","Безолюк Анастасия Евгеньевна","Бородавкин Иван Игоревич","Бугаева Ева Сергеевна","Ельнева Мария Сергеевна","Згадова Ангелина Владимировна","Илларионов Александр Сергеевич","Козелькина Екатерина Витальевна","Колобова Екатерина Александровна","Левичев Илья Дмитриевич","Майоров Артём Сергеевич","Матвеева Вероника Александровна","Монайкина Каролина Игоревна","Мусатова Анастасия Александровна","Надежкина    Мария Сергеевна","Петровский Марк Айратович","Петухов Никита Дмитриевич","Постоялко Мария Валерьевна","Рустамова Анастасия Алексеевна","Семёнов Александр Сергеевич","Синченко Татьяна Анатольевна","Смирнова Анастасия Андреевна","Сологуб Вероника Александровна","Тарасов Вадим Витальевич","Фролов Денис Алексеевич","Целищев Данила Юрьевич","Школин Роман Андреевич","Арапова Юлия Николаевна","Бровкина Алина Владимировна","Высоцкий Артур Степанович","Гаряев Александр Александрович","Глушко Даниил Александрович","Двоеглазов Мирон Михайлович","Драскинис Максим Антонович","Ефремова Татьяна Сергеевна","Иванов Евгений Игоревич","Историн Владислав Романович","Кардаков Максим Фёдорович","Костылёва Алина Юрьевна","Котов Матвей Андреевич","Мужиков Владислав Александрович","Никифорук Виктория Вадимовна","Орлов Владислав Александрович","Поснова Дарья Денисовна","Ряжева Кристина Андреевна","Семенов Иван Дмитриевич","Сергеев Егор Сергеевич","Соловьёв Данила Дмитриевич","Терещук Карина Михайловна","Федулов Сергей Эдуардович","Фоминцева Мария Алексеевна","Чернявская Анастасия Алексеевна","Шабанова Екатерина Вячеславовна","Штыкова Алина Александровна","Юндт Катерина Витальевна","Азбукин Вениамин Александрович","Ветлугина Анастасия Владимировна","Вист Арина Сергеевна","Головчак Максим Дмитриевич","Дементеева Елизавета Руслановна","Зольников Данила Владимирович","Иньков    Дмитрий Вячеславович","Керн Анастасия Владимировна","Коробкина Анна Алексеевна","Куринова Виктория Евгеньевна","Лисянова Анна Владимировна","Морозов Никита Витальевич","Москаленко Никита Олегович","Нестерова Полина Викторовна","Олейник Илона Владимировна","Петрушко Дмитрий Андреевич","Сергеев Вячеслав Викторович","Сидельников Арсений Сергеевич","Сидельникова Дарья Максимовна","Сидоров Арсений Александрович","Трегубов Александр Михайлович","Тывровский Максим Владимирович","Фирсов Тимур Алексеевич","Шепелева Арина Сергеевна","Шкарупа Владимир Владимирович","Щербина Виталий Дмитриевич","Юрчик Дарья Петровна","Якимов Егор Михайлович","Барсуков Валерий Евгеньевич","Бедарева Анастасия Сергеевна","Богданов   Кирилл Павлович","Евдокимцева Яна Александровна","Ерёмин Кирилл Алексеевич","Каминская Алина Витальевна","Кобрина Вероника Антоновна","Колесникова Яна Сергеевна","Коношенко Анна Игоревна","Кучеров Александр Алексеевич","Лебедев Павел Сергеевич","Лим Руслан Николаевич","Любимов Данила Андреевич","Маркевич Илия Владимирович","Никишин Владислав Сергеевич","Петухова Елизавета Андреевна","Помогаева Екатерина Максимовна","Савченкова Александра Александровна","Саенко Данила Владимирович","Седова Ксения Ильинична","Сизикова Карина Романовна","Суриков Егор Владимирович","Танник Ксения Сергеевна","Тимчук Ирина Дмитриевна","Третяк Анастасия Григорьевна","Третяк Анастасия Григорьевна","Уралов Егор Евгеньевич","Щапова Мария Алексеевна","Галактионова Анастасия Дмитриевна","Горбачёва Арина Андреевна","Гудкова Софья Сергеевна","Давыдов Денис Сергеевич","Елохин Денис Сергеевич","Катков Илья Сергеевич","Карасёв Данил Игоревич","Лобов Александр Владимирович","Найда Андрей Алексеевич","Песоцкий Марк Александрович","Пастухова Кристина Максимовна","Полгина Полина Александровна","Пчелинцев Валентин Викторович","Пфау Эдгар Александрович","Романюк Анастасия Игоревна","Рублёв Артур Алексеевич","Руденко Алексей Александрович","Рябичка Дарья Андреевна","Светкина Екатерина Александровна","Сергеев Иван Сергеевич","Соколова Валерия Алексеевна","Соломянюк София Игоревна","Сорокин Денис Андреевич","Сухова Татьяна Андреевна","Сячинова Виолетта Алексеевна","Фомичева Арина Игоревна","Шовгенова Элина Зауровна","Янышева Анастасия Алексеевна","Атрашенко Елизавета Игоревна","Богачева Валерия Александровна","Бородулина Анна Александровна","Бусыгин Александр Игоревич","Выборнов Владислав Алексеевич","Гребнев Иван Алексеевич","Давыдова Элеонора Юрьевна","Дедков Дмитрий Андреевич","Иванов Артём Сергеевич","Коновалова Алиса Александровна","Кулиева Елизавета Кирилловна","Лебезова Лилия Андреевна","Микрюков Лука Сергеевич","Навродская Виоллета Олеговна","Плисик Карина Александровна","Плисик Кристина Александровна","Савикин Влад Игоревич","Салихова Альбина Ильясовна","Свечникова Татьяна Владиславовна","Смехов Павел Александрович","Федосеев Ян Владиславович","Филончук Данила Сергеевич","Фролова Алина Дмитриевна","Фролова Анна Алексеевна","Халатова Полина Ильинична","Халецкая Анастасия Алексеевна","Чернобылец Максим Андреевич","Чечин Никита Андреевич","Чугунов Михаил Александрович","Шемелин Александр Сергеевич","Аверьянова Марина Евгеньевна","Баженова Екатерина Александровна","Ватагина Анна Владиславовна","Вершкова Екатерина Витальевна","Виткаускас Анастасия Эдуардовна","Вяткин Лев Андреевич","Давыденко Богдан Николаевич","Дмитриенко Алина Леонидовна","Дмитриенко Алина Леонидовна","Звеков Андрей Юрьевич","Зубарев Андрей Александрович","Карпенко Дарья Алексеевна","Копать Юлия Владимировна","Кравченко Никита Андреевич","Кузнецова Анастасия Андреевна","Логошина Анастасия Амировна","Максимов Андрей Владимирович","Максимов Андрей Владимирович","Назаренко Даниил Сергеевич","Найда Юлия Алексеевна","Павлов Павел Игоревич","Подойницын Артем Валерьевич","Пятенко Мария Сергеевна","Райко Юрий Викторович","Романова Анна Дмитриевна","Сергеева Диана Игоревна","Сердюков Матвей Евгеньевич","Солдатенков Дмитрий Вячеславович","Титова Анна Сергеевна","Шестаков Егор Вадимович","Шестаков Егор Вадимович","Щупка Алексей Дмитриевич","Холманова Полина Николаевна","Агеев Родион Витальевич","Александрова Анастасия Александровна","Арабян Кристина Рустамовна","Арабян Лейла Рустамовна","Аракелян Нарэк Мамиконович","Березкин Александр Александрович","Видясов Даниил Сергеевич","Геращенко Татьяна Максимовна","Гнедко Евгений Николаевич","Гриненко Инна Сергеевна","Гудков Егор Дмитриевич","Колесник Анастасия Олеговна","Крестоверов Александр Максимович","Липендин Максим Станиславович","Любушкина Елизавета Александровна","Матасов Дмитрий Сергеевич","Меркулов Егор Владимирович","Мовшович Анастасия Игоревна","Морозова Виктория Игоревна","Моторный Максим Александрович","Мурина Диана Александровна","Попова Анна Геннадьевна","Слипухова Мария Ивановна","Смоленская Алина Владиславовна","Сокова Марианна Сергеевна","Троицкая Надежда Анатольевна","Ушакова Анастасия Игоревна","Челюбеев Владимир Игоревич","Шленцова Дарья Дмитриевна","Щербина Кристина Владимировна","Андрияускас Демид Андреевич","Баева Ольга Романовна","Бельская Юлия Денисовна","Бойцов Семен Романович","Брыксин Денис Дмитриевич","Будзинаускас Олег Ричардович","Гончарова Наталья Николаевна","Гущин Александр Дмитриевич","Дуничева Анна Сергеевна","Изотова Анастасия Денисовна","Казакова Дарья Александровна","Калошина Анастасия Руслановна","Клепус Кристина Дмитриевна","Кочура Андрей Витальевич","Кривко Софья Сергеевна","Кутузова Дарья Руслановна","Мазун Татьяна Игоревна","Мандрикин Антон Викторович","Маханов Егор Максимович","Меркулов Данила Максимович","Меркулов Данила Максимович","Олейник Владислав Валерьевич","Пасынко Кристина Сергеевна"," Сизов Сергей Владимирович","Соколова Анастасия Витальевна","Сосновская Татьяна Денисовна","Торшилов Илья Николаевич","Цветков Дмитрий Дмитриевич","Шапорева Таисия Тимуровна","Шевель Денис Андреевич","Шурпик Алиса Борисовна","Белова Софья Алексеевна","Бирюкова Марина Михайловна","Васильев Максим Евгеньевич","Гаевский Максим Алексеевич","Гаенко Ангелина Андреевна","Груздис Алла Олеговна","Гладких Алина Александровна","Дружинин Сергей Юрьевич","Евдокимов Виктор Андреевич","Еремина Елизавета Федоровна","Келарев Илья Михайлович","Коврижкин Максим Сергеевич","Коврижкин Максим Сергеевич","Коровин Ростислав Алексеевич","Кузина Валерия Владиславовна","Кузьмин Ростислав Александрович","Леонко Даниил Евгеньевич","Малова Дарья Михайловна","Маркелова Екатерина Владимировна","Никитина Александра Геннадьевна","Охотенко Данил Артемович","Радаева Анастасия Владиславовна","Спиридонова Марта-Полина Денисовна","Тарасевич Елизавета Евгеньевна","Теран Денис Евгеньевич","Ульянов Никита Борисович","Феклистов Данил Андреевич","Феклистов Данил Андреевич","Хоптенко Ульяна Евгеньевна","Хрыпов Никита Тимофеевич","Шарамкина Екатерина Владиславовна","Антанюк Виктория Дмитриевна","Анчугина Анастасия Игоревна","Баршенцева Полина Анатольевна","Бугаева Ирина Александровна","Буркина Ксения Евгеньевна","Василенко Анастасия Руслановна","Емельяненко Варвара Андреевна","Жеребьев Василий Александрович","Зенов Олег Сергеевич","Ивко Владислава Витальевна","Кажаева Александра Константиновна","Кондратьев Максим Александрович","Кондратьев Максим Александрович","Коровная Анастасия Александровна","Лазарев Андрей Валерьевич","Лёзов Егор Эдуардович","Михайлов Дмитрий Андреевич","Михайлов Дмитрий Андреевич","Мясников Самсон Сергеевич","Назарова Екатерина Сергеевна","Околокулак Данил Станиславович","Павлова Олеся Петровна","Перегудов Илья Евгеньевич","Понская Мария Сергеевна","Рамазанов Муса Алиевич","Рослов Ярослав Олегович","Сидоров Святослав Игоревич","Струк Даниил Александрович","Харламова Виктория Сергеевна","Шадраускас Александр Александрович","Шадраускас Александр Александрович","Яковлев Александр Вугарович","Авакумова Елизавета Андреевна","Антипин Егор Алексеевич","Бачурская Валерия Николаевна","Бирюкова Яна Борисовна","Блага Михаил Михайлович","Бондарева Валерия Евгеньевна","Верещагин Владислав Анатольевич","Вовк Максим Русланович","Вовк Михаил Русланович","Войтенко Валерия Евгеньевна","Гаврилов Александр Сергеевич","Гросс Полина Ивановна","Дерксен Даниил Вячеславович","Жулинский Глеб Анатольевич","Жулинский Глеб Анатольевич","Кабанова Анастасия Анатольевна","Каинова Анна Сергеевна","Комягина Елизавета Юрьевна","Крицкова Анастасия Андреевна","Кузьминых Владислав Анатольевич","Ларченкова Анна Ильинична","Маловичко Василина Васильевна","Мусейченко Данил Александрович","Рыбалко Маргарита Михайловна","Сазонов Артем Александрович","Соловей Полина Андреевна","Тарасова Алиса Андреевна","Тимофеев Никита Константинович","Филимонов Филипп Михайлович","Харитонов Никита Алексеевич","Черезов Егор Андреевич","Бессмертная Валерия Александровна","Бубнова Ксения Николаевна","Дедков Владислав Андреевич","Дьякова Виолетта Викторовна","Ерастова Екатерина Николаевна","Жданюк Виктория Валерьевна","Защеринская Елизавета Сергеевна","Зерникова Ульяна Дмитриевна","Зубин Андрей Алексеевич","Камышанский Дмитрий Владимирович","Кокина Анастасия Владимировна","Конорева Анастасия Романовна","Котров Тимофей Александрович","Крыжановская Кристина Александровна","Лебедев Максим Сергеевич","Логунова Мария Владимировна","Матюхов Никита Олегович","Островский Кирилл Алексеевич","Петрушко Максим Григорьевич","Пилецкая Олеся Евгеньевна","Полозова    Марина Игоревна","Ротонен Руслан Андреевич","Ряжева Ксения Андреевна","Свистунова    Анастасия Игоревна","Семеняко Юрий Алексеевич","Семеняко Юрий Алексеевич","Сигачёва Дарья Дмитриевна","Холодырь Ангелина Андреевна","Чигрецкий Виталий Сергеевич","Юрданов Игорь Святославович","Юрданов Игорь Святославович","Яковлев Глеб Львович","Яковлев Глеб Львович","Антонов Дмитрий Олегович","Белкина Кристина Максимовна","Белоносова Дарина Вячеславовна","Березкин Кирилл Александрович","Брыксин Никита Дмитриевич","Василевич Эмилия Александровна","Волков Алексей Валерьевич","Гавриков Денис Игоревич","Добреньков Вячеслав Дмитриевич","Журавлев Станислав Николаевич","Иванов Никита Андреевич","Касачева Татьяна Васильевна","Кислицына Евгения Алексеевна","Кислицын Максим Дмитриевич","Коробейникова Анастасия Андреевна","Котляр Роман Андреевич","Лабзина Алина Игоревна","Лещук Максим Денисович","Лисянова Анастасия Владимировна","Морозов Даниил Дмитриевич","Никулин Владислав Дмитриевич","Степанов Сергей Максимович","Титова Мария Сергеевна","Толстенёв Вячеслав Евгеньевич","Федюшкина Анастасия Павловна","Шевнин Михаил Сергеевич","Шенец Владислав Эдуардович","Шепелев Тимур Сергеевич","Ягодкина Валерия Вадимовна","Боровец Алена Александровна","Егоров Денис Сергеевич","Жигалин Валерий Павлович","Клещина Анастасия Алексеевна","Козова Валерия Константиновна","Кузнецов Иван Павлович","Лукьяненко Наталья Эдуардовна","Малинина Александра Евгеньевна","Михайлова Татьяна Сергеевна","Морозов Илья Сергеевич","Нерсесян Анита Артуровна","Никифоров Егор Сергеевич","Околодков Максим Владимирович","Пасечник Роман Олегович","Петрова Юлия Дмитриевна","Печенкина Екатерина Александровна","Пушкарев Вадим Алексеевич","Сиротин Максим Евгеньевич","Соловьёва Анна Васильевна","Сушкина Дарья Дмитриевна","Тулякова Таисия Евгеньевна","Федоров Иван Дмитриевич","Чернова Полина Сергеевна","Чуракова Елизавета Романовна","Шерстобитов Глеб Игоревич","Шишкин Алексей Михайлович","Шпак Андрей Александрович","Яшин Леонид Евгеньевич","Безруков Максим Алексеевич","Белисова Юлия Игоревна","Боброва Евгения Олеговна","Войцеховская Александра Андреевна","Волканеску Мария Владимировна","Гаврилова Анна Сергеевна","Генералов Дмитрий Викторович","Георгиу Алексей     ","Дуничева Екатерина Сергеевна","Егудина Юлия Игоревна","Зайцева Анастасия Витальевна","Коновалова Валерия Александровна","Краснов Артем Борисович","Лебедев Михаил Андреевич","Лобов Артем Дмитриевич","Москвитин Илья Владимирович","Никишина Алина Сергеевна","Носов Виктор Юрьевич","Перевозчикова Анна Сергеевна","Подовинникова Дарья Андреевна","Познякова Диана Евгеньевна","Сеничева Анастасия Алексеевна","Урбанайть Александр Александрович","Урбанайть Олеся Александровна","Халюк Валерия Владимировна","Цурбанова Арина Андреевна","Шперлинг Сергей Александрович","Яшкин Кирилл Дмитриевич","Алексюк Ирина Михайловна","Андреева Анастасия Алексеевна","Апанасенко Мария Романовна","Бахрамова Салвар Нураддин кызы","Божко Дмитрий Олегович","Бочерикова Ирина Юрьевна","Гущина Мария Дмитриевна","Дорофеева Екатерина Евгеньевна","Иванова Мария Александровна","Кирса Ирина Александровна","Ковалевич Кирилл Евгеньевич","Корнилова Ольга Олеговна","Крылова Дарья Борисовна","Куцак Артур Юрьевич","Маркелова Елизавета Владимировна","Науменко Игорь Вадимович","Новиков Дмитрий Владимирович","Поддубная Екатерина Романовна","Полосин Павел Владимирович","Пугачёва Татьяна Леонидовна","Санников Вадим Олегович","Сидоренко Светлана Владимировна","Соседко Кирилл Александрович","Стенников Виктор Николаевич","Тристан Кристина Николаевна","Фоминцев Егор Алексеевич","Хроленко Роман Александрович","Шерстнева Дарья Васильевна","Азарян-Ареян Арам Григориевич","Брагин Илья Владимирович","Бугштейн Валерия Николаевна","Герл Александр Юрьевич","Евдокимова Екатерина Евгеньевна","Елеуов Ален Амангалиевич","Емельянова Анастасия Александровна","Ерошин Алексей Евгеньевич","Лин Раиса Константиновна","Лонская Вероника Владимировна","Магеровский Тарас Сергеевич","Мацулёва Софья Андреевна","Морозов Никита Сергеевич","Остапенко Эльмира Михайловна","Поменчук Евгения Денисовна","Пономарев Артем Алексеевич","Потапов Владимир Николаевич","Романюк Александр Александрович","Ряжев Степан Андреевич","Семенова Светлана Владимировна","Смирнов Ефим Игоревич","Смыков Егор Игоревич","Солдак Иван Сергеевич","Транова Анастасия Олеговна","Филанович Андрей Владимирович","Харченко Екатерина Романовна","Шпендик Наталья Сергеевна","Авдаева Екатерина Денисовна","Баденко Анастасия Андреевна","Бакаленко Игорь Вадимович","Вишнякова Дарья Алексеевна","Власова Ксения Витальевна","Гениевская Юлия Сергеевна","Глибка Екатерина Юрьевна","Горбунова Екатерина Юрьевна","Горяинова Елена Владимировна","Демёшина Виолетта Анатольевна","Дёмин Даниил Сергеевич","Дикович Виктория Андреевна","Занько Григорий Олегович","Касперавичуте Инга Людо","Кисмати Эдуард Баратович","Коваль Карина Николаевна","Марченко Леонид Игоревич","Моткина Екатерина Андреевна","Парфенов Вадим Дмитриевич","Пятенко Дмитрий Сергеевич","Смирнова Алина Анатольевна","Стахив Вадим Олегович","Фёдоров Павел Сергеевич","Фурс Ангелина Анатольевна","Харусь Виктор Олегович","Церр Александр Евгеньевич","Чикнаева Виталия Сергеевна","Андрияускас Вячеслав Андреевич","Анохин Илья Алексеевич","Аркадьева Дарья Евгеньевна","Балабанов Владислав Валерьевич","Блашко Даниил Владимирович","Гаштов Иван Андреевич","Герасимов Владислав Игоревич","Гладыщук Даниил Романович","Жданова Анастасия Михайловна","Карташов Денис Сергеевич","Комиссаров Евгений Дмитриевич","Корженко Никита Евгеньевич","Кравченко Олег Владимирович","Мирон Артур Георгиевич","Мирон Артур Георгиевич","Орлов Михаил Евгеньевич","Павлова Анна Михайловна","Пасынко Александр Павлович","Рабушок Анастасия Дмитриевна","Рогожан Александра Александровна","Рогожан Александра Александровна","Ручкина Анна Павловна","Санников Алексей Александрович","Тетерина Виктория Андреевна","Худяков Михаил Андреевич","Чеснокова Арина Владимировна","Шоттер Ангелина Сергеевна","Янбекова Александра Камильевна","Авезов Юрий Евгеньевич","Алексеенко Наталья Алексеевна","Банбуркин Юрий Васильевич","Белова Наталья Евгеньевна","Бухтоярова Диана Феликсовна","Валеев Кирилл Дмитриевич","Волович Михаил Романович","Головченко Валерия Игоревна","Дударева Ольга Игоревна","Котов Никита Вячеславович","Крайнюченко Арина Андреевна","Лапова Екатерина Андреевна","Маловичко Игорь Васильевич","Мизин Игорь Владимирович","Парамонова Карина Алексеевна","Поднебесных Александра Владимировна","Потапенкова Полина Викторовна","Сафинова Юлия Михайловна","Севостьянов Даниил Вадимович","Соловьёва Алина Александровна","Струков Андрей Сергеевич","Цебро Алина Александровна","Цибульский Егор Сергеевич","Черепкова Виктория Алексеевна","Шульга Вадим Владимирович","Щербаков Илья Игоревич","Алтынпара Анастасия Игоревна","Ананьева Алина Андреевна","Близниченко Мария Алексеевна","Вешкина Евгения Владимировна","Власова Ангелина Андреевна","Гуреева Виктория Валерьевна","Домосканова Анастасия Владимировна","Зубрихин Владимир Викторович","Исаева Мария Александровна","Кривошеина Ангелина Алексеевна","Кузнецов Даниил Вадимович","Ланге Денис Петрович","Летовальцев Максим Сергеевич","Молотивский Максим Юрьевич","Морозов Илья Юрьевич","Мохначёва Юлианна Александровна","Немцева Анастасия Александровна","Николаева Анастасия Игоревна","Радько Марина Сергеевна","Саркисян Артур Каренович","Сорокина Дарья Васильевна","Шерпитис Дарья Пятровна","Асланян Анна Мартиковна","Белоносов Александр Вячеславович","Горенко Лидия Николаевна","Груздев Александр Андреевич","Дода Екатерина Игоревна","Кремлёв Владимир Алексеевич","Маркелов Борис Глебович","Матусевич Полина Викторовна","Михолап Полина Александровна","Мишкина Виктория Андреевна","Орехова Маргарита Сергеевна","Стальмакова Мария Михайловна","Тарасенко Владимир Геннадьевич","Томчук Сергей Сергеевич","Тюрикова Валерия Вячеславовна","Холод Дарья Андреевна","Чечулинский Алексей Романович","Чигорина Алёна Валерьевна","Шаган Дарья Игоревна","Шаган Мария Игоревна","Шлюсарски Мартин Ярославович","Яковлева Антонина Вугаровна","Брысин Андрей Александрович","Буланцева Дарья Алексеевна","Герасимова Ксения Михайловна","Глазачева Елизавета Сергеевна","Григорьева Дарья Николаевна","Леонова Анастасия Валерьевна","Лешов Максим Витальевич","Назарова Дарья Владиславовна","Никитина Елизавета Денисовна","Павленко Надежда Евгеньевна","Переверза Екатерина Андреевна","Повитчан Владислав Евгеньевич","Поспелов Константин Олегович","Поспелов Константин Олегович","Рогожан Святослав Александрович","Рогожан Святослав Александрович","Сальников Владимир Геннадьевич","Соловьев Денис Сергеевич","Степаржинская Виктория Александровна","Тимошенко Дмитрий Александрович","Тоймастов Рустам Улугбекович","Трифонов Александр Евгеньевич","Червяков Виктор Викторович","Анисимов Олег Андреевич","Баев Павел Сергеевич","Бахарев Борис Владимирович","Букреева Ксения Дмитриевна","Герасимов Вячеслав Викторович","Демочкин Олег Владимирович","Исмаилов Алияр Исламович","Кабанова Надежда Алексеевна","Каручек Анастасия Владимировна","Кожевникова Татьяна Андреевна","Козелькина Татьяна Витальевна","Макась Глеб Андреевич","Милер Роман Олегович","Мустафаева Светлана Ильясовна","Наниев Георгий Таймуразович","Сущевский Александр Александрович","Сырцова Анастасия Ивановна","Хорева Юлия Сергеевна","Чечина Евгения Андреевна","Шарфнотас Дмитрий Видмантович","Адаричев Илья Николаевич","Баскакова Тамара Алексеевна","Беднякова Екатерина Дмитриевна","Богомолова Екатерина Михайловна","Буркин Николай Евгеньевич","Буров Илья Сергеевич","Злыгостева Евгения Юрьевна","Иванова Марина Игоревна","Калабина Анастасия Петровна","Котова Виолетта Игоревна","Леонова Анастасия Святославовна","Моторная Дарья Александровна","Пи Варгас Саманта   ","Ротонен Роман Андреевич","Рыбин Игорь Владимирович","Рыбин Игорь Владимирович","Суслова Виктория Дмитриевна","Шеменев Алексей Андреевич","Алдохина Дарья Михайловна","Байдалина Полина Владимировна","Винивитин Андрей Андреевич","Жупанова Виктория Евгеньевна","Зиновьева Эвелина Николаевна","Ищенко Алина Андреевна","Кружкова Екатерина Андреевна","Лоза Анастасия Олеговна","Мизин Александр Владимирович","Мишин Кирилл Вячеславович","Морозов Борис Андреевич","Мохнач Оксана Витальевна","Погудо Елизавета Владимировна","Сандальнева Светлана Алексеевна","Сергеева Оксана Игоревна","Степаненко Виктор Алексеевич","Степаненко Илья Михайлович","Чернова Нонна Артуровна","Черняева Кристина Олеговна","Шаповал Борис Сергеевич","Шмытова Анастасия Сергеевна","Щирая Дарья Игоревна","Глушкова Анастасия Дмитриевна","Глушкова Анастасия Дмитриевна","Горев Лев Антонович","Доценко Мария Александровна","Заталова Екатерина Александровна","Иванова Нателла Тамазиевна","Кольцов Алексей Сергеевич","Коробкин Евгений Сергеевич","Куашева Луиза Зауровна","Лебедева Александра Александровна","Макарова Кристина Николаевна","Моисеева Алёна Ивановна","Наумова Татьяна Александровна","Пенькова Анастасия Олеговна","Прокопчик Мария Игоревна","Пучик Юлия Андреевна","Пчелинцев Владислав Максимович","Пчелинцев Владислав Максимович","Румянцев Артём Александрович","Столярчук Татьяна Николаевна","Титова Екатерина Михайловна","Усманов Артём Тимурович","Эманкулова Камилла Бахтияровна","Дедов Александр Александрович","Фёдорова Оксана Рэмовна","Полозкова Нина Николаевна","Ушакова Ирина Александровна","Погудо Владимир Кимович","Серченко Таисия Александровна","Шенгель Мария Яковлевна","Трушникова Ирина Васильевна","Скворцова Анна Александровна","Беловодченко Любовь Сергеевна","Полищук Анна Анатольевна","Воропаева Наталья Геннадьевна","Фельдман Елена Геннадьевна","Воропаев Михаил Сергеевич","Метёлкина Дарья Дмитриевна","Кохия Любовь Владимировна","Кохия Любовь Владимировна","Машевская Лариса Анатольевна","Бувин Артём Романович","Рак Валентина Ивановна","Черняев Илья Олегович","Ветлугина Елена Владимировна","Калужская Римма Шаевна","Арабян Роман Рустамович","Черноталов Александр Анатольевич","Гернер Елизавета Александровна","Васильева Елизавета Андреевна","Судакова Ксения Алексеевна","Луцюк Алина Владимировна","Любчанская Елена Сергеевна","Суворова Мария Петровна","Поляков Кирилл Витальевич","Фигурова Алина Витальевна","Котова Анастасия Сергеевна","Чернуха Михаил Игоревич","Оганисян Илья Варданович","Шихов Евгений Сергеевич","Давидович Анастасия Владимировна","Камаев Дмитрий Владимирович","Поклонская Лилия Дмитриевна","Фирсова Юлия Павловна","Субботина Кристина Александровна","Косова Анастасия Дмитриевна","Елистратова Александра Константиновна","Никитина Светлана Алексеевна","Мосякина Анастасия Владимировна","Степанова Татьяна Юрьевна","Косюга Анастасия Александровна","Бурдюгова Галина Николаевна","Герасимова Надежда Николаевна","Давыденко Наталья Николаевна","Деревягина Елена Дмитриевна","Князев Борис Павлович","Кожара Галина Константиновна","Охотников Анатолий Михайлович","Сташек Владимир Владимирович","Тарасов Виктор Филиппович","Текучев Кирилл Дмитриевич","Текучев Кирилл Дмитриевич","Фомин Валерий Васильевич","Ширяев Юрий Николаевич","Ермолаева Елена Николаевна","Офутин Петр Михайлович","Березянский Лев Сергеевич","Георгиев Илья Валерьевич","Мамедов Руслан Чингизович","Вист Елена Викторовна","Маханова Юлия Юрьевна","Сова Дмитрий Романович","Бураков Даниил Олегович","Запталова Екатерина Александровна","Барсукова Эвелина Леонидовна","Эшанкулова Камилла Бахтияровна","Соловьева Анастасия Юрьевна","Соловьев Всеволод Юрьевич","Iteco Петр Петров","Соломенюк Игорь Владимирович","Павленко Павел Максимович","Горошинская Елизавета Вячеславовна","Соломянюк Игорь Владимирович","Попельская Жанна Анатольевна","Никифорова Елена Геннадьевна","Карасёв Игорь Павлович","Кувекина Татьяна Михайловна","Щербаков Александр Андреевич","Михайлов Дмитрий Иванович","Картынник Михаил Юрьевич","Ротнов Даниил Владимирович","Осипов Вадим Александрович","Москалёв Вячеслав Александрович","Тюрикова Надежда Ивановна","Ракитянский Артём Вячеславович","Епихин Максим Владимирович","Клименко Алина Алексеевна","Еремин Владислав Алексеевич","Бурундукова Марина Вадимовна","Ткаченко Иван Анатольевич","Исмаилов Юрий Вадимович","Кузмицкий Руслан Сергеевич","Низола Валерия Алексеевна","Левина Валерия Максимовна","Базылев Михаил Дмитриевич","Чешихина Анна Юрьевна","Левоник Мария Александровна","Попов Юрий Иванович","Сауленас Анастасия Николаевна","Кащук Людмила Алексеевна","Комарова Алла Станиславовна","Саенко Сергей Петрович","Римкус Юлия Юрьевна","Горелик Елена Владимировна","Кулагин Дмиртрий Юрьевич","Никифоров Иван Андреевич","Вознов Георгий Константинович","Шелест Олег Романович","Бородин Игорь Артурович","Видюк Владислав Алексеевич","Булах Алина Юрьевна","Кныш Лариса Ивановна","Запанов Александр Павлович","Стреляева Анастасия Владимировна","Кучковская Анастасия Андреевна","Польских Дмитрий Алексеевич"};
    private Long[] clientContracts = new Long[]{18L,34L,34L,34L,42L,42L,59L,59L,67L,67L,75L,83L,83L,91L,91L,109L,117L,117L,125L,133L,141L,158L,166L,174L,182L,190L,216L,216L,224L,232L,240L,257L,257L,265L,273L,281L,281L,299L,307L,307L,315L,323L,331L,349L,356L,364L,372L,380L,398L,406L,414L,422L,430L,448L,455L,463L,463L,471L,489L,497L,505L,521L,521L,539L,547L,554L,562L,570L,620L,638L,646L,653L,661L,679L,687L,695L,703L,711L,729L,737L,745L,752L,760L,778L,786L,794L,802L,810L,828L,836L,844L,851L,869L,885L,893L,901L,901L,919L,919L,927L,927L,935L,935L,943L,943L,950L,950L,968L,976L,976L,984L,992L,1008L,1016L,1024L,1032L,1040L,1057L,1065L,1073L,1081L,1099L,1107L,1115L,1123L,1131L,1149L,1156L,1164L,1180L,1198L,1206L,1214L,1230L,1248L,1255L,1263L,1271L,1289L,1297L,1305L,1313L,1321L,1339L,1347L,1354L,1370L,1388L,1396L,1404L,1412L,1420L,1438L,1446L,1453L,1461L,1479L,1487L,1495L,1503L,1511L,1529L,1537L,1545L,1552L,1560L,1578L,1586L,1594L,1602L,1610L,1628L,1636L,1644L,1651L,1669L,1677L,1685L,1693L,1701L,1719L,1727L,1735L,1743L,1750L,1768L,1776L,1784L,1792L,1800L,1818L,1826L,1834L,1842L,1859L,1867L,1875L,1883L,1891L,1909L,1917L,1925L,1933L,1941L,1958L,1966L,1974L,1982L,1990L,2006L,2014L,2022L,2030L,2048L,2055L,2063L,2071L,2089L,2097L,2105L,2113L,2113L,2121L,2139L,2147L,2154L,2162L,2170L,2188L,2196L,2204L,2212L,2220L,2238L,2246L,2253L,2261L,2279L,2287L,2295L,2303L,2311L,2329L,2337L,2345L,2352L,2360L,2378L,2386L,2394L,2402L,2410L,2428L,2436L,2444L,2451L,2469L,2477L,2485L,2493L,2501L,2519L,2527L,2535L,2543L,2550L,2568L,2576L,2584L,2592L,2600L,2618L,2626L,2634L,2642L,2659L,2667L,2675L,2683L,2691L,2709L,2717L,2725L,2733L,2741L,2758L,2766L,2774L,2782L,2790L,2808L,2816L,2824L,2832L,2840L,2857L,2865L,2873L,2881L,2899L,2907L,2915L,2923L,2931L,2949L,2956L,2964L,2972L,2980L,2998L,3004L,3012L,3020L,3038L,3046L,3053L,3061L,3079L,3087L,3095L,3103L,3111L,3129L,3137L,3145L,3152L,3160L,3178L,3186L,3194L,3202L,3210L,3228L,3236L,3244L,3251L,3269L,3277L,3285L,3293L,3301L,3319L,3327L,3335L,3343L,3350L,3368L,3376L,3384L,3392L,3400L,3418L,3426L,3434L,3442L,3459L,3467L,3475L,3483L,3491L,3509L,3517L,3525L,3533L,3541L,3558L,3566L,3574L,3582L,3590L,3608L,3616L,3624L,3632L,3640L,3657L,3665L,3673L,3681L,3699L,3707L,3715L,3723L,3731L,3749L,3756L,3764L,3772L,3780L,3798L,3806L,3814L,3822L,3830L,3848L,3855L,3863L,3871L,3889L,3897L,3905L,3913L,3921L,3921L,3939L,3947L,3954L,3962L,3970L,3988L,3996L,4002L,4010L,4028L,4036L,4044L,4051L,4069L,4077L,4085L,4093L,4101L,4119L,4127L,4135L,4143L,4150L,4168L,4176L,4184L,4192L,4200L,4218L,4226L,4234L,4242L,4259L,4267L,4275L,4283L,4291L,4309L,4317L,4325L,4333L,4341L,4358L,4366L,4374L,4382L,4390L,4408L,4416L,4424L,4432L,4440L,4457L,4465L,4473L,4481L,4499L,4507L,4515L,4523L,4531L,4549L,4556L,4564L,4572L,4580L,4598L,4606L,4606L,4614L,4622L,4630L,4648L,4655L,4663L,4671L,4689L,4689L,4697L,4705L,4713L,4721L,4739L,4747L,4754L,4762L,4770L,4788L,4796L,4804L,4804L,4812L,4820L,4838L,4846L,4853L,4861L,4879L,4887L,4895L,4903L,4911L,4929L,4937L,4945L,4952L,4960L,4978L,4986L,4994L,5009L,5017L,5025L,5033L,5041L,5058L,5066L,5074L,5082L,5090L,5108L,5116L,5124L,5132L,5140L,5157L,5165L,5173L,5181L,5199L,5207L,5215L,5223L,5231L,5249L,5256L,5264L,5272L,5280L,5298L,5306L,5314L,5322L,5322L,5330L,5348L,5355L,5363L,5371L,5389L,5397L,5405L,5413L,5421L,5439L,5447L,5454L,5462L,5470L,5488L,5496L,5504L,5512L,5520L,5538L,5546L,5546L,5553L,5561L,5579L,5587L,5595L,5603L,5611L,5629L,5637L,5645L,5652L,5660L,5678L,5686L,5686L,5694L,5702L,5710L,5728L,5736L,5744L,5751L,5769L,5777L,5785L,5793L,5801L,5819L,5827L,5835L,5835L,5843L,5850L,5868L,5876L,5876L,5884L,5892L,5900L,5918L,5926L,5934L,5942L,5959L,5967L,5975L,5983L,5991L,5991L,6007L,6015L,6023L,6031L,6049L,6056L,6064L,6072L,6080L,6098L,6106L,6114L,6122L,6130L,6148L,6148L,6155L,6163L,6171L,6189L,6197L,6205L,6213L,6221L,6239L,6247L,6254L,6262L,6270L,6288L,6296L,6304L,6312L,6320L,6338L,6346L,6353L,6361L,6379L,6387L,6395L,6403L,6411L,6429L,6437L,6445L,6452L,6460L,6478L,6486L,6494L,6502L,6510L,6528L,6536L,6544L,6551L,6551L,6569L,6577L,6585L,6593L,6593L,6601L,6601L,6619L,6627L,6635L,6643L,6650L,6668L,6676L,6684L,6692L,6700L,6718L,6726L,6734L,6742L,6759L,6767L,6775L,6783L,6791L,6809L,6817L,6825L,6833L,6841L,6858L,6866L,6874L,6882L,6890L,6908L,6916L,6924L,6932L,6940L,6957L,6965L,6973L,6981L,6999L,7005L,7013L,7021L,7039L,7047L,7054L,7062L,7070L,7088L,7096L,7104L,7112L,7120L,7138L,7146L,7153L,7161L,7179L,7187L,7195L,7203L,7211L,7229L,7237L,7245L,7252L,7260L,7278L,7286L,7294L,7302L,7310L,7328L,7336L,7344L,7351L,7369L,7377L,7385L,7393L,7401L,7419L,7427L,7435L,7443L,7450L,7468L,7476L,7484L,7492L,7500L,7518L,7526L,7534L,7542L,7559L,7567L,7575L,7583L,7591L,7609L,7617L,7625L,7633L,7641L,7658L,7666L,7674L,7682L,7690L,7708L,7716L,7724L,7732L,7740L,7757L,7765L,7773L,7781L,7799L,7807L,7815L,7823L,7831L,7849L,7856L,7864L,7872L,7880L,7898L,7906L,7914L,7922L,7930L,7948L,7955L,7963L,7971L,7989L,7997L,8003L,8011L,8029L,8037L,8045L,8052L,8060L,8078L,8086L,8094L,8102L,8110L,8128L,8136L,8144L,8151L,8169L,8177L,8185L,8193L,8201L,8219L,8227L,8235L,8243L,8250L,8268L,8276L,8284L,8292L,8300L,8318L,8326L,8334L,8342L,8359L,8367L,8375L,8383L,8391L,8409L,8417L,8417L,8425L,8433L,8441L,8458L,8466L,8466L,8474L,8482L,8490L,8508L,8516L,8524L,8532L,8540L,8557L,8565L,8573L,8581L,8599L,8607L,8615L,8623L,8631L,8649L,8656L,8664L,8672L,8680L,8698L,8706L,8714L,8722L,8730L,8748L,8755L,8763L,8771L,8789L,8797L,8805L,8813L,8821L,8839L,8847L,8854L,8862L,8870L,8888L,8896L,8904L,8912L,8920L,8938L,8946L,8953L,8961L,8979L,8987L,8995L,9001L,9019L,9027L,9035L,9043L,9050L,9068L,9076L,9084L,9092L,9100L,9118L,9126L,9134L,9142L,9159L,9167L,9175L,9183L,9191L,9209L,9217L,9225L,9233L,9241L,9258L,9266L,9274L,9282L,9290L,9308L,9316L,9324L,9332L,9340L,9357L,9365L,9365L,9373L,9373L,9381L,9399L,9407L,9415L,9423L,9431L,9449L,9456L,9464L,9472L,9480L,9498L,9506L,9514L,9522L,9530L,9548L,9555L,9563L,9571L,9589L,9597L,9605L,9613L,9621L,9639L,9647L,9654L,9662L,9670L,9688L,9696L,9704L,9712L,9720L,9738L,9746L,9753L,9761L,9779L,9787L,9795L,9795L,9803L,9811L,9829L,9837L,9845L,9852L,9860L,9878L,9886L,9894L,9902L,9910L,9928L,9936L,9944L,9951L,9969L,9977L,9985L,9993L,10009L,10017L,10025L,10033L,10041L,10041L,10058L,10066L,10074L,10082L,10090L,10108L,10116L,10124L,10132L,10140L,10157L,10165L,10173L,10181L,10199L,10199L,10207L,10215L,10223L,10231L,10249L,10256L,10264L,10272L,10280L,10298L,10306L,10314L,10322L,10330L,10348L,10355L,10363L,10371L,10389L,10397L,10405L,10405L,10413L,10421L,10439L,10447L,10454L,10462L,10470L,10488L,10496L,10504L,10512L,10520L,10538L,10546L,10553L,10561L,10579L,10587L,10595L,10603L,10611L,10629L,10637L,10645L,10652L,10660L,10678L,10686L,10694L,10702L,10710L,10744L,10751L,10769L,10777L,10793L,10801L,10819L,10843L,10868L,10876L,10876L,10900L,10918L,10926L,10934L,10942L,10959L,10967L,10975L,10983L,10991L,11007L,11015L,11023L,11031L,11049L,11056L,11064L,11072L,11080L,11098L,11106L,11114L,11122L,11130L,11148L,11155L,11163L,11171L,11189L,11197L,11205L,11213L,11221L,11239L,11247L,11254L,11262L,11270L,11288L,11296L,11304L,11312L,11320L,11338L,11346L,11353L,11361L,11379L,11387L,11395L,11403L,11411L,11429L,11437L,11445L,11452L,11460L,11478L,11486L,11494L,11502L,11510L,11528L,11536L};

    
    public void testPrint() {
        System.out.println("Hello!");
    }

    @Override
    protected void setUp() throws Exception {
        //Way4PaymentTest.setUpClientSSL();
        PaymentWSTest.setUpSSL();
    }

    public void testCall() throws Exception {

        System.setProperty("com.sun.xml.ws.transport.http.client.HttpTransportPipe.dump", "true");
        ClientRoomControllerWSService service = new ClientRoomControllerWSService();
        ClientRoomController port
                = service.getClientRoomControllerWSPort();
        //((BindingProvider)port).getRequestContext().put(BindingProvider.ENDPOINT_ADDRESS_PROPERTY, "https://109.237.3.46:8443/processor/soap/client");
        ((BindingProvider)port).getRequestContext().put(BindingProvider.ENDPOINT_ADDRESS_PROPERTY, "http://10.126.216.2:3000/gateway/services/SID0003080");
        //((BindingProvider)port).getRequestContext().put(BindingProvider.ENDPOINT_ADDRESS_PROPERTY, "http://188.254.16.92:7777/gateway/services/SID0003038");
        //((BindingProvider)port).getRequestContext().put(BindingProvider.ENDPOINT_ADDRESS_PROPERTY, "https://127.0.0.1:8443/processor/soap/client");
        ((BindingProvider)port).getRequestContext().put(JAXWSProperties.HOSTNAME_VERIFIER, new PaymentWSTest.TestHostnameVerifier());
        List<Handler> handlerChain = new ArrayList<Handler>();
              handlerChain.add(new LogMessageHandler());

        ((BindingProvider)port).getBinding().setHandlerChain(handlerChain);
        Map context = ((BindingProvider) port).getRequestContext();
        context.put(BindingProvider.USERNAME_PROPERTY, "dnevnik.ru");
        context.put(BindingProvider.PASSWORD_PROPERTY, "D4inxdo3inid");
        //String fullNameUpCase = "Кожевникова Татьяна Андреевна".replaceAll("\\s", "").toUpperCase();
        //String fullNameUpCase = "Тарасова Алиса Андреевна".replaceAll("\\s", "").toUpperCase();
        for (int i=0; i<clientFIOs.length;i++){
            String fullNameUpCase = clientFIOs[i].replaceAll("\\s", "").toUpperCase();
            long clientId=clientContracts[i];
            fullNameUpCase= fullNameUpCase+"Nb37wwZWufB";
            byte[] bytesOfMessage = fullNameUpCase.getBytes("UTF-8");
            MessageDigest md = MessageDigest.getInstance("MD5");
            byte[] hash = md.digest(bytesOfMessage);
            BigInteger bigInt = new BigInteger(1, hash);
            //String md5HashString = bigInt.toString(16);
            //BigInteger bi = new BigInteger(1, hash);
            String md5HashString = String.format("%0" + (hash.length << 1) + "X", bigInt);
            //long clientId=6262L;//200485L;//7613912L
            Result ra = port.authorizeClient(clientId, md5HashString);
            //System.out.println("dnevnik.ru test");
            //System.out.println("https://109.237.3.46:8443/processor/soap/client");
            //System.out.println("AUTH CLIENTID: " + clientId);
            if(ra.getResultCode()!=0){
                System.err.println("AUTH CLIENT "+ clientId +": " + ra.getResultCode()+":"+ra.getDescription());
            }  else {
                System.out.println("AUTH CLIENT: " + ra.getResultCode()+":"+ra.getDescription());
            }
            //ClientSummaryResult r = port.getSummary(clientId);
            //ClientSummaryExt client = r.getClientSummary();
            //System.out.println("CLIENT FirstName: " + client.getFirstName());
            //System.out.println("CLIENT LastName: " + client.getLastName());
            //System.out.println("CLIENT MiddleName: " + client.getMiddleName());
        }
        //CardListResult cardListResult = port.getCardList(clientId);
        //for (CardItem cardItem: cardListResult.getCardList().getC()){
        //    System.out.println("\t CARD Crystal: " + cardItem.getCrystalId());
        //    System.out.println("\t CARD State: " + cardItem.getState());
        //    System.out.println("\t CARD Type: " + cardItem.getType());
        //}

    }
    
}
